app/controllers/api/v1/badges_controller.rb

SELECT "badges".* FROM "badges"
---
        def index
            @badges = Badge.all