app/controllers/api/v1/earned_badges_controller.rb

    def index
      @earned_badges = EarnedBadge.all
---
SELECT "earned_badges".* FROM "earned_badges"