app/controllers/api/v1/player_calculations_controller.rb

        def index
            @player_calculations = PlayerCalculation.all
---
SELECT "player_calculations".* FROM "player_calculations"