app/controllers/api/v1/practices_controller.rb

SELECT "practices".* FROM "practices"
---
        def index
            @practices = Practice.all

INSERT INTO "practices" ("team_id", "duration", "difficulty", "practice_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["team_id", 1], ["duration", 120], ["difficulty", 7], ["practice_time", "2018-04-04 22:00:00"], ["created_at", "2018-04-04 02:24:22.517471"], ["updated_at", "2018-04-04 02:24:22.517471"]]
---

                current_practice = Practice.new(team_id: practice_params[:team_id], duration: practice_params[:duration], difficulty: practice_params[:difficulty], practice_time: practice_time_mult)
                if current_practice.valid?
                  all_practices << current_practice