app/controllers/api/v1/rostereds_controller.rb

        def index
            @rostereds = Rostered.all
---
SELECT "rostereds".* FROM "rostereds"