app/controllers/api/v1/surveys_controller.rb

        def index
            @surveys = Survey.all
---
SELECT "surveys".* FROM "surveys"