app/controllers/api/v1/teams_controller.rb

INSERT INTO "teams" ("sport", "gender", "season", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["sport", "soccer"], ["gender", "men"], ["season", "fall"], ["active", "t"], ["created_at", "2018-03-06 16:25:23.107200"], ["updated_at", "2018-03-06 16:25:23.107200"]]
---
        def create
            @team = Team.new(team_params)
            if @team.save