app/controllers/api/v1/team_assignments_controller.rb

        def index
            @team_assignments = TeamAssignment.all
---
SELECT "team_assignments".* FROM "team_assignments"