app/controllers/badges_controller.rb

SELECT "badges".* FROM "badges"
---
    def index
        @badges = Badge.all

INSERT INTO "badges" ("badge_name", "requirements", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["badge_name", "Test"], ["requirements", "TestRequirement"], ["created_at", "2018-03-05 02:50:56.016191"], ["updated_at", "2018-03-05 02:50:56.016191"]]
---
    def create
        @badge = Badge.new(badge_params)
        if @badge.save