app/controllers/practices_controller.rb

SELECT "practices".* FROM "practices"
---
    def index
        @practices = Practice.all