app/controllers/rostereds_controller.rb

SELECT "rostereds".* FROM "rostereds"
---
    def index
        @rostereds = Rostered.all