app/controllers/teams_controller.rb

INSERT INTO "teams" ("sport", "gender", "season", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["sport", "soccer"], ["gender", "men"], ["season", "winter"], ["active", "t"], ["created_at", "2018-03-06 03:58:41.343434"], ["updated_at", "2018-03-06 03:58:41.343434"]]
---
    def create
        @team = Team.new(team_params)
        if @team.save