app/controllers/team_calculations_controller.rb

SELECT "team_calculations".* FROM "team_calculations"
---
    def index
        @team_calculations = TeamCalculation.all